TriAGB/Rtos_Lesson2/Release Internal/startup_stm32g474retx_PP.s
# 0 "W:\\PortableGit\\REPO1\\SMT32\\Rtos_Lesson2\\Core\\Startup\\startup_stm32g474retx.s"
# 0 "<built-in>"
# 0 "<command-line>"
# 1 "W:\\PortableGit\\REPO1\\SMT32\\Rtos_Lesson2\\Core\\Startup\\startup_stm32g474retx.s"
# 28 "W:\\PortableGit\\REPO1\\SMT32\\Rtos_Lesson2\\Core\\Startup\\startup_stm32g474retx.s"
  .syntax unified
 .cpu cortex-m4
 .fpu softvfp
 .thumb

.global g_pfnVectors
.global Default_Handler



.word _sidata

.word _sdata

.word _edata

.word _sbss

.word _ebss

.equ BootRAM, 0xF1E0F85F
# 58 "W:\\PortableGit\\REPO1\\SMT32\\Rtos_Lesson2\\Core\\Startup\\startup_stm32g474retx.s"
    .section .text.Reset_Handler
 .weak Reset_Handler
 .type Reset_Handler, %function
Reset_Handler:
  ldr r0, =_estack
  mov sp, r0


  ldr r0, =_sdata
  ldr r1, =_edata
  ldr r2, =_sidata
  movs r3, #0
  b LoopCopyDataInit

CopyDataInit:
  ldr r4, [r2, r3]
  str r4, [r0, r3]
  adds r3, r3, #4

LoopCopyDataInit:
  adds r4, r0, r3
  cmp r4, r1
  bcc CopyDataInit


  ldr r2, =_sbss
  ldr r4, =_ebss
  movs r3, #0
  b LoopFillZerobss

FillZerobss:
  str r3, [r2]
  adds r2, r2, #4

LoopFillZerobss:
  cmp r2, r4
  bcc FillZerobss


    bl SystemInit

    bl __libc_init_array

 bl main

LoopForever:
    b LoopForever

.size Reset_Handler, .-Reset_Handler
# 116 "W:\\PortableGit\\REPO1\\SMT32\\Rtos_Lesson2\\Core\\Startup\\startup_stm32g474retx.s"
    .section .text.Default_Handler,"ax",%progbits
Default_Handler:
Infinite_Loop:
 b Infinite_Loop
 .size Default_Handler, .-Default_Handler







  .section .isr_vector,"a",%progbits
 .type g_pfnVectors, %object
 .size g_pfnVectors, .-g_pfnVectors


g_pfnVectors:
 .word _estack
 .word Reset_Handler
 .word NMI_Handler
 .word HardFault_Handler
 .word MemManage_Handler
 .word BusFault_Handler
 .word UsageFault_Handler
 .word 0
 .word 0
 .word 0
 .word 0
 .word SVC_Handler
 .word DebugMon_Handler
 .word 0
 .word PendSV_Handler
 .word SysTick_Handler
 .word WWDG_IRQHandler
 .word PVD_PVM_IRQHandler
 .word RTC_TAMP_LSECSS_IRQHandler
 .word RTC_WKUP_IRQHandler
 .word FLASH_IRQHandler
 .word RCC_IRQHandler
 .word EXTI0_IRQHandler
 .word EXTI1_IRQHandler
 .word EXTI2_IRQHandler
 .word EXTI3_IRQHandler
 .word EXTI4_IRQHandler
 .word DMA1_Channel1_IRQHandler
 .word DMA1_Channel2_IRQHandler
 .word DMA1_Channel3_IRQHandler
 .word DMA1_Channel4_IRQHandler
 .word DMA1_Channel5_IRQHandler
 .word DMA1_Channel6_IRQHandler
 .word DMA1_Channel7_IRQHandler
 .word ADC1_2_IRQHandler
 .word USB_HP_IRQHandler
 .word USB_LP_IRQHandler
 .word FDCAN1_IT0_IRQHandler
 .word FDCAN1_IT1_IRQHandler
 .word EXTI9_5_IRQHandler
 .word TIM1_BRK_TIM15_IRQHandler
 .word TIM1_UP_TIM16_IRQHandler
 .word TIM1_TRG_COM_TIM17_IRQHandler
 .word TIM1_CC_IRQHandler
 .word TIM2_IRQHandler
 .word TIM3_IRQHandler
 .word TIM4_IRQHandler
 .word I2C1_EV_IRQHandler
 .word I2C1_ER_IRQHandler
 .word I2C2_EV_IRQHandler
 .word I2C2_ER_IRQHandler
 .word SPI1_IRQHandler
 .word SPI2_IRQHandler
 .word USART1_IRQHandler
 .word USART2_IRQHandler
 .word USART3_IRQHandler
 .word EXTI15_10_IRQHandler
 .word RTC_Alarm_IRQHandler
 .word USBWakeUp_IRQHandler
 .word TIM8_BRK_IRQHandler
 .word TIM8_UP_IRQHandler
 .word TIM8_TRG_COM_IRQHandler
 .word TIM8_CC_IRQHandler
 .word ADC3_IRQHandler
 .word FMC_IRQHandler
 .word LPTIM1_IRQHandler
 .word TIM5_IRQHandler
 .word SPI3_IRQHandler
 .word UART4_IRQHandler
 .word UART5_IRQHandler
 .word TIM6_DAC_IRQHandler
 .word TIM7_DAC_IRQHandler
 .word DMA2_Channel1_IRQHandler
 .word DMA2_Channel2_IRQHandler
 .word DMA2_Channel3_IRQHandler
 .word DMA2_Channel4_IRQHandler
 .word DMA2_Channel5_IRQHandler
 .word ADC4_IRQHandler
 .word ADC5_IRQHandler
 .word UCPD1_IRQHandler
 .word COMP1_2_3_IRQHandler
 .word COMP4_5_6_IRQHandler
 .word COMP7_IRQHandler
 .word HRTIM1_Master_IRQHandler
 .word HRTIM1_TIMA_IRQHandler
 .word HRTIM1_TIMB_IRQHandler
 .word HRTIM1_TIMC_IRQHandler
 .word HRTIM1_TIMD_IRQHandler
 .word HRTIM1_TIME_IRQHandler
 .word HRTIM1_FLT_IRQHandler
 .word HRTIM1_TIMF_IRQHandler
 .word CRS_IRQHandler
 .word SAI1_IRQHandler
 .word TIM20_BRK_IRQHandler
 .word TIM20_UP_IRQHandler
 .word TIM20_TRG_COM_IRQHandler
 .word TIM20_CC_IRQHandler
 .word FPU_IRQHandler
 .word I2C4_EV_IRQHandler
 .word I2C4_ER_IRQHandler
 .word SPI4_IRQHandler
 .word 0
 .word FDCAN2_IT0_IRQHandler
 .word FDCAN2_IT1_IRQHandler
 .word FDCAN3_IT0_IRQHandler
 .word FDCAN3_IT1_IRQHandler
 .word RNG_IRQHandler
 .word LPUART1_IRQHandler
 .word I2C3_EV_IRQHandler
 .word I2C3_ER_IRQHandler
 .word DMAMUX_OVR_IRQHandler
 .word QUADSPI_IRQHandler
 .word DMA1_Channel8_IRQHandler
 .word DMA2_Channel6_IRQHandler
 .word DMA2_Channel7_IRQHandler
 .word DMA2_Channel8_IRQHandler
 .word CORDIC_IRQHandler
 .word FMAC_IRQHandler
# 261 "W:\\PortableGit\\REPO1\\SMT32\\Rtos_Lesson2\\Core\\Startup\\startup_stm32g474retx.s"
 .weak NMI_Handler
 .thumb_set NMI_Handler,Default_Handler

 .weak HardFault_Handler
 .thumb_set HardFault_Handler,Default_Handler

 .weak MemManage_Handler
 .thumb_set MemManage_Handler,Default_Handler

 .weak BusFault_Handler
 .thumb_set BusFault_Handler,Default_Handler

 .weak UsageFault_Handler
 .thumb_set UsageFault_Handler,Default_Handler

 .weak SVC_Handler
 .thumb_set SVC_Handler,Default_Handler

 .weak DebugMon_Handler
 .thumb_set DebugMon_Handler,Default_Handler

 .weak PendSV_Handler
 .thumb_set PendSV_Handler,Default_Handler

 .weak SysTick_Handler
 .thumb_set SysTick_Handler,Default_Handler

 .weak WWDG_IRQHandler
 .thumb_set WWDG_IRQHandler,Default_Handler

 .weak PVD_PVM_IRQHandler
 .thumb_set PVD_PVM_IRQHandler,Default_Handler

 .weak RTC_TAMP_LSECSS_IRQHandler
 .thumb_set RTC_TAMP_LSECSS_IRQHandler,Default_Handler

 .weak RTC_WKUP_IRQHandler
 .thumb_set RTC_WKUP_IRQHandler,Default_Handler

 .weak FLASH_IRQHandler
 .thumb_set FLASH_IRQHandler,Default_Handler

 .weak RCC_IRQHandler
 .thumb_set RCC_IRQHandler,Default_Handler

 .weak EXTI0_IRQHandler
 .thumb_set EXTI0_IRQHandler,Default_Handler

 .weak EXTI1_IRQHandler
 .thumb_set EXTI1_IRQHandler,Default_Handler

 .weak EXTI2_IRQHandler
 .thumb_set EXTI2_IRQHandler,Default_Handler

 .weak EXTI3_IRQHandler
 .thumb_set EXTI3_IRQHandler,Default_Handler

 .weak EXTI4_IRQHandler
 .thumb_set EXTI4_IRQHandler,Default_Handler

 .weak DMA1_Channel1_IRQHandler
 .thumb_set DMA1_Channel1_IRQHandler,Default_Handler

 .weak DMA1_Channel2_IRQHandler
 .thumb_set DMA1_Channel2_IRQHandler,Default_Handler

 .weak DMA1_Channel3_IRQHandler
 .thumb_set DMA1_Channel3_IRQHandler,Default_Handler

 .weak DMA1_Channel4_IRQHandler
 .thumb_set DMA1_Channel4_IRQHandler,Default_Handler

 .weak DMA1_Channel5_IRQHandler
 .thumb_set DMA1_Channel5_IRQHandler,Default_Handler

 .weak DMA1_Channel6_IRQHandler
 .thumb_set DMA1_Channel6_IRQHandler,Default_Handler

 .weak DMA1_Channel7_IRQHandler
 .thumb_set DMA1_Channel7_IRQHandler,Default_Handler

 .weak ADC1_2_IRQHandler
 .thumb_set ADC1_2_IRQHandler,Default_Handler

 .weak USB_HP_IRQHandler
 .thumb_set USB_HP_IRQHandler,Default_Handler

 .weak USB_LP_IRQHandler
 .thumb_set USB_LP_IRQHandler,Default_Handler

 .weak FDCAN1_IT0_IRQHandler
 .thumb_set FDCAN1_IT0_IRQHandler,Default_Handler

 .weak FDCAN1_IT1_IRQHandler
 .thumb_set FDCAN1_IT1_IRQHandler,Default_Handler

 .weak EXTI9_5_IRQHandler
 .thumb_set EXTI9_5_IRQHandler,Default_Handler

 .weak TIM1_BRK_TIM15_IRQHandler
 .thumb_set TIM1_BRK_TIM15_IRQHandler,Default_Handler

 .weak TIM1_UP_TIM16_IRQHandler
 .thumb_set TIM1_UP_TIM16_IRQHandler,Default_Handler

 .weak TIM1_TRG_COM_TIM17_IRQHandler
 .thumb_set TIM1_TRG_COM_TIM17_IRQHandler,Default_Handler

 .weak TIM1_CC_IRQHandler
 .thumb_set TIM1_CC_IRQHandler,Default_Handler

 .weak TIM2_IRQHandler
 .thumb_set TIM2_IRQHandler,Default_Handler

 .weak TIM3_IRQHandler
 .thumb_set TIM3_IRQHandler,Default_Handler

 .weak TIM4_IRQHandler
 .thumb_set TIM4_IRQHandler,Default_Handler

 .weak I2C1_EV_IRQHandler
 .thumb_set I2C1_EV_IRQHandler,Default_Handler

 .weak I2C1_ER_IRQHandler
 .thumb_set I2C1_ER_IRQHandler,Default_Handler

 .weak I2C2_EV_IRQHandler
 .thumb_set I2C2_EV_IRQHandler,Default_Handler

 .weak I2C2_ER_IRQHandler
 .thumb_set I2C2_ER_IRQHandler,Default_Handler

 .weak SPI1_IRQHandler
 .thumb_set SPI1_IRQHandler,Default_Handler

 .weak SPI2_IRQHandler
 .thumb_set SPI2_IRQHandler,Default_Handler

 .weak USART1_IRQHandler
 .thumb_set USART1_IRQHandler,Default_Handler

 .weak USART2_IRQHandler
 .thumb_set USART2_IRQHandler,Default_Handler

 .weak USART3_IRQHandler
 .thumb_set USART3_IRQHandler,Default_Handler

 .weak EXTI15_10_IRQHandler
 .thumb_set EXTI15_10_IRQHandler,Default_Handler

 .weak RTC_Alarm_IRQHandler
 .thumb_set RTC_Alarm_IRQHandler,Default_Handler

 .weak USBWakeUp_IRQHandler
 .thumb_set USBWakeUp_IRQHandler,Default_Handler

 .weak TIM8_BRK_IRQHandler
 .thumb_set TIM8_BRK_IRQHandler,Default_Handler

 .weak TIM8_UP_IRQHandler
 .thumb_set TIM8_UP_IRQHandler,Default_Handler

 .weak TIM8_TRG_COM_IRQHandler
 .thumb_set TIM8_TRG_COM_IRQHandler,Default_Handler

 .weak TIM8_CC_IRQHandler
 .thumb_set TIM8_CC_IRQHandler,Default_Handler

 .weak ADC3_IRQHandler
 .thumb_set ADC3_IRQHandler,Default_Handler

 .weak FMC_IRQHandler
 .thumb_set FMC_IRQHandler,Default_Handler

 .weak LPTIM1_IRQHandler
 .thumb_set LPTIM1_IRQHandler,Default_Handler

 .weak TIM5_IRQHandler
 .thumb_set TIM5_IRQHandler,Default_Handler

 .weak SPI3_IRQHandler
 .thumb_set SPI3_IRQHandler,Default_Handler

 .weak UART4_IRQHandler
 .thumb_set UART4_IRQHandler,Default_Handler

 .weak UART5_IRQHandler
 .thumb_set UART5_IRQHandler,Default_Handler

 .weak TIM6_DAC_IRQHandler
 .thumb_set TIM6_DAC_IRQHandler,Default_Handler

 .weak TIM7_DAC_IRQHandler
 .thumb_set TIM7_DAC_IRQHandler,Default_Handler

 .weak DMA2_Channel1_IRQHandler
 .thumb_set DMA2_Channel1_IRQHandler,Default_Handler

 .weak DMA2_Channel2_IRQHandler
 .thumb_set DMA2_Channel2_IRQHandler,Default_Handler

 .weak DMA2_Channel3_IRQHandler
 .thumb_set DMA2_Channel3_IRQHandler,Default_Handler

 .weak DMA2_Channel4_IRQHandler
 .thumb_set DMA2_Channel4_IRQHandler,Default_Handler

 .weak DMA2_Channel5_IRQHandler
 .thumb_set DMA2_Channel5_IRQHandler,Default_Handler

 .weak ADC4_IRQHandler
 .thumb_set ADC4_IRQHandler,Default_Handler

 .weak ADC5_IRQHandler
 .thumb_set ADC5_IRQHandler,Default_Handler

 .weak UCPD1_IRQHandler
 .thumb_set UCPD1_IRQHandler,Default_Handler

 .weak COMP1_2_3_IRQHandler
 .thumb_set COMP1_2_3_IRQHandler,Default_Handler

 .weak COMP4_5_6_IRQHandler
 .thumb_set COMP4_5_6_IRQHandler,Default_Handler

 .weak COMP7_IRQHandler
 .thumb_set COMP7_IRQHandler,Default_Handler

 .weak HRTIM1_Master_IRQHandler
 .thumb_set HRTIM1_Master_IRQHandler,Default_Handler

 .weak HRTIM1_TIMA_IRQHandler
 .thumb_set HRTIM1_TIMA_IRQHandler,Default_Handler

 .weak HRTIM1_TIMB_IRQHandler
 .thumb_set HRTIM1_TIMB_IRQHandler,Default_Handler

 .weak HRTIM1_TIMC_IRQHandler
 .thumb_set HRTIM1_TIMC_IRQHandler,Default_Handler

 .weak HRTIM1_TIMD_IRQHandler
 .thumb_set HRTIM1_TIMD_IRQHandler,Default_Handler

 .weak HRTIM1_TIME_IRQHandler
 .thumb_set HRTIM1_TIME_IRQHandler,Default_Handler

 .weak HRTIM1_FLT_IRQHandler
 .thumb_set HRTIM1_FLT_IRQHandler,Default_Handler

 .weak HRTIM1_TIMF_IRQHandler
 .thumb_set HRTIM1_TIMF_IRQHandler,Default_Handler

 .weak CRS_IRQHandler
 .thumb_set CRS_IRQHandler,Default_Handler

 .weak SAI1_IRQHandler
 .thumb_set SAI1_IRQHandler,Default_Handler

 .weak TIM20_BRK_IRQHandler
 .thumb_set TIM20_BRK_IRQHandler,Default_Handler

 .weak TIM20_UP_IRQHandler
 .thumb_set TIM20_UP_IRQHandler,Default_Handler

 .weak TIM20_TRG_COM_IRQHandler
 .thumb_set TIM20_TRG_COM_IRQHandler,Default_Handler

 .weak TIM20_CC_IRQHandler
 .thumb_set TIM20_CC_IRQHandler,Default_Handler

 .weak FPU_IRQHandler
 .thumb_set FPU_IRQHandler,Default_Handler

 .weak I2C4_EV_IRQHandler
 .thumb_set I2C4_EV_IRQHandler,Default_Handler

 .weak I2C4_ER_IRQHandler
 .thumb_set I2C4_ER_IRQHandler,Default_Handler

 .weak SPI4_IRQHandler
 .thumb_set SPI4_IRQHandler,Default_Handler

 .weak FDCAN2_IT0_IRQHandler
 .thumb_set FDCAN2_IT0_IRQHandler,Default_Handler

 .weak FDCAN2_IT1_IRQHandler
 .thumb_set FDCAN2_IT1_IRQHandler,Default_Handler

 .weak FDCAN3_IT0_IRQHandler
 .thumb_set FDCAN3_IT0_IRQHandler,Default_Handler

 .weak FDCAN3_IT1_IRQHandler
 .thumb_set FDCAN3_IT1_IRQHandler,Default_Handler

 .weak RNG_IRQHandler
 .thumb_set RNG_IRQHandler,Default_Handler

 .weak LPUART1_IRQHandler
 .thumb_set LPUART1_IRQHandler,Default_Handler

 .weak I2C3_EV_IRQHandler
 .thumb_set I2C3_EV_IRQHandler,Default_Handler

 .weak I2C3_ER_IRQHandler
 .thumb_set I2C3_ER_IRQHandler,Default_Handler

 .weak DMAMUX_OVR_IRQHandler
 .thumb_set DMAMUX_OVR_IRQHandler,Default_Handler

 .weak QUADSPI_IRQHandler
 .thumb_set QUADSPI_IRQHandler,Default_Handler

 .weak DMA1_Channel8_IRQHandler
 .thumb_set DMA1_Channel8_IRQHandler,Default_Handler

 .weak DMA2_Channel6_IRQHandler
 .thumb_set DMA2_Channel6_IRQHandler,Default_Handler

 .weak DMA2_Channel7_IRQHandler
 .thumb_set DMA2_Channel7_IRQHandler,Default_Handler

 .weak DMA2_Channel8_IRQHandler
 .thumb_set DMA2_Channel8_IRQHandler,Default_Handler

 .weak CORDIC_IRQHandler
 .thumb_set CORDIC_IRQHandler,Default_Handler

 .weak FMAC_IRQHandler
 .thumb_set FMAC_IRQHandler,Default_Handler
